<?php

namespace app\common\validate;

use think\Validate;

/**
 * ============================================================================
 * 通用文件
 * ============================================================================
 * 版权所有 2014-2028 长沙德尚网络科技有限公司，并保留所有权利。
 * 网站地址: http://www.csdeshang.com
 * ----------------------------------------------------------------------------
 * 这不是一个自由软件！您只能在不用于商业目的的前提下对程序代码进行修改和使用 .
 * 不允许对程序代码以任何形式任何目的的再发布。
 * ============================================================================
 * 验证器
 */
class Feedback extends Validate {

    protected $rule = [
        'fb_content' => 'require|length:0,255',
    ];
    protected $message = [
        'fb_content.require' => '反馈内容不能为空',
        'fb_content.length' => '反馈内容长度不能大于255',
    ];
    protected $scene = [
        'add' => ['fb_content'],
        'edit' => ['fb_content'],
    ];
}
